src/InformationRegisters/СтатусыВыгрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СтатусыВыгрузки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Выгружается</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьОшибкиВыгрузки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Хранилище</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Хранилища</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/СтатусыВыгрузки/Ext/ManagerModule.bsl
Процедура Выгружается( Знач пХранилище ) Экспорт

	мз = РегистрыСведений.СтатусыВыгрузки.СоздатьМенеджерЗаписи();
	мз.Хранилище = пХранилище;
	мз.Прочитать();
	мз.Хранилище = пХранилище;
	мз.Выгружается = Истина;
	мз.Записать();

КонецПроцедуры

Процедура Выгружено( Знач пХранилище ) Экспорт

	мз = РегистрыСведений.СтатусыВыгрузки.СоздатьМенеджерЗаписи();
	мз.Хранилище = пХранилище;
	мз.Выгружается = Ложь;
	мз.Записать();

КонецПроцедуры

Процедура ЗавершеноСОшибками( Знач пХранилище, Знач пТекстОшибки ) Экспорт

	мз = РегистрыСведений.СтатусыВыгрузки.СоздатьМенеджерЗаписи();
	мз.Хранилище = пХранилище;
	мз.Выгружается = Ложь;
	мз.ЕстьОшибкиВыгрузки = Истина;
	мз.ТекстОшибки = пТекстОшибки;
	мз.Записать();

КонецПроцедуры
